# Command-line tools
brew "awscli"
brew "bat"
brew "gh"
brew "mise"
brew "render"
brew "ripgrep"
brew "supabase"

# macOS setup helpers used by bootstrap and workstation configuration
brew "defaultbrowser"
brew "displayplacer"
brew "dockutil"
brew "duti"

# Security and credentials
cask "1password"
cask "1password-cli"

# Developer tools
cask "bruno"
cask "cursor"
cask "gcloud-cli"
cask "ngrok"
cask "orbstack"

# Browsers and AI applications
# ChatGPT may already be present when Codex is installed outside Homebrew.
cask "chatgpt" unless File.exist?("/Applications/ChatGPT.app")
cask "chatgpt-atlas"
cask "claude"
cask "firefox"
cask "google-chrome"
cask "granola"

# Communication and productivity
cask "figma"
cask "loom"
cask "notion"
cask "notion-calendar"
cask "slack"
cask "superhuman"
cask "superwhisper"

# macOS workflow
cask "alt-tab"
cask "raycast"
cask "rectangle-pro"
cask "warp"

# Media
cask "gimp"
cask "spotify"
cask "vlc"
