asdf
awscli
curl
direnv
ffmpeg
fontconfig
gettext
gh
git
git-filter-repo
imagemagick
nmap
unzip
wget
wireshark
1password
1password-cli
alt-tab
caffeine
chatgpt
cursor
claude
discord
docker
figma
firefox
flux
font-fira-code-nerd-font
font-fira-mono-nerd-font
font-hack-nerd-font
gimp
google-chrome
ngrok
notion
notion-calendar
numi
obsidian
postman
raycast
rectangle
slack
spotify
superwhisper
tableplus
vlc
warp
zoom
# brew install asdf awscli curl direnv ffmpeg fontconfig gettext gh git git-filter-repo imagemagick nmap unzip wget wireshark 1password 1password-cli alt-tab caffeine chatgpt cursor claude discord docker figma firefox flux font-fira-code-nerd-font font-fira-mono-nerd-font font-hack-nerd-font gimp google-chrome ngrok notion notion-calendar numi obsidian postman raycast rectangle slack spotify superwhisper tableplus vlc warp zoom
